package com.tbfp.teamplannerbe.domain.member.nickname;

import lombok.Getter;

@Getter
public enum Adjective {
    살아있는, 숨쉬는, 전통적인, 다양한, 효율적인, 적응하는, 거대한, 귀여운, 자그마한, 큰, 작은, 빠른, 느린, 밝은, 어두운, 높은, 낮은, 강한, 약한, 뜨거운, 차가운, 새로운, 오래된, 예쁜, 행복한, 슬픈, 웃는, 우는, 소리치는, 조용한, 똑똑한, 바쁜, 여유로운, 좋은, 부드러운, 거친, 희미한, 선명한, 깨끗한, 산뜻한, 상쾌한, 꿈나무, 꿈꾸는, 창의적인, 진취적인, 정직한, 부지런한, 믿음직한, 의심하는, 기뻐하는, 실망한, 만족한, 무료한, 유료한, 신선한, 향기로운, 냉정한, 열정적인, 긍정적인, 열심히하는, 침착한, 확신하는, 자유로운, 속박된, 가난한, 부유한, 정교한, 날카로운, 지루한, 활기찬, 시끄러운, 흥미로운, 자연의, 인공의, 현실적인, 비현실적인, 경계가없는, 무선의, 유선의, 무효한, 유효한, 냉소적인, 친절한, 공정한, 공평한, 타협적인, 진정한, 근심하는, 걱정없는, 걱정하는, 황당한, 일반적인, 독특한, 소수의, 다수의, 희귀한, 흔한, 복잡한, 단순한, 예방하는, 치료하는, 길고, 짧은, 기쁜, 안정적인, 불안정한, 안전한, 위험한, 성공적인, 풍부한, 경제적인, 비경제적인, 감사하는, 의존적인, 독립적인, 인정받는, 만족스러운, 희망적인, 절망적인, 명확한, 모호한, 포괄적인, 특정한, 진실한, 혼란스러운, 합리적인, 명령하는, 복종하는, 용감한, 냉담한, 인내하는, 즐거운, 존경하는, 감동적인, 무관심한, 질투하는, 무시하는, 배려하는, 관심있는, 관심없는, 자유분방한, 보수적인, 진보적인, 유쾌한, 고독한, 활발한, 화난, 고요한, 낙관적인, 비관적인, 무감동한, 열린, 열려있는, 협조적인, 존경받는, 가치있는, 가치없는, 애정있는, 무정한, 충실한, 무심한, 민감한, 나약한, 신뢰하는, 바람직한, 이상적인, 관대한, 엄격한, 오픈마인드, 미개한, 미진한, 의식적인, 무의식적인, 직관적인, 호의적인, 적대적인, 비평적인, 침묵하는, 수다스러운, 개방된, 무관한;
}
