package com.tbfp.teamplannerbe.domain.member.nickname;

import lombok.Getter;

@Getter
public enum Noun {
    강아지, 개, 고양이, 소, 말, 돼지, 양, 닭, 오리, 거북, 뱀, 사자, 호랑이, 코끼리, 길잡이, 늑대, 곰, 사슴, 원숭이, 고릴라, 판다, 기린, 하마, 바다거북, 돌고래, 고래, 오소리, 족제비, 악어, 바다마름, 물개, 펭귄, 치타, 기러기, 비둘기, 독수리, 원앙, 커누리, 해마, 참새, 오리너구리, 고슴도치, 메뚜기, 흑집사, 판도라, 버팔로, 외뿔소, 바다표범, 노루, 표범, 오랑우탄, 앵무새, 카멜레온, 카라카라, 미포커스, 스컹크, 흑치수, 물소, 물쇠바퀴벌레, 코요테, 두더지, 알파카, 개구리, 사막여우, 멧돼지, 병아리, 햄스터, 타조, 공작새, 친칠라, 동고바리, 크라켄, 랫스네이크, 젖소, 갈매기, 흰햅, 야생마, 파이어앤텔, 복어, 바다토끼, 개미핥기, 콘도르, 개미곰, 다람쥐, 불가사리, 너구리, 무당벌레, 케네런, 민다리, 노랑머리원숭이, 청원숭이, 무릎달갱이, 백조, 쿼카, 캥거루, 호랑이상어, 왕도마뱀, 왕판다, 긴머리해녀, 낙타, 노랑상어, 노란펭귄, 눈더미, 담비, 도롱뇽, 망태어, 물새, 박쥐, 북극곰, 솜방귀, 수달, 아나콘다, 아르마딜로, 암모나이트, 어류, 외계인, 오로라, 캉가루, 가젤, 젤리피쉬, 전래동물, 진주, 천사고래, 쿠데타, 커몬, 카라바오, 버스, 캡슐, 바이올린, 브라스헤드, 불곰, 코끼리원숭이, 골룸, 폴라로이드, 소주, 엑소더스, 블루, 카우, 더불음, 로그, 로버트, 루이, 썬글라스, 라디오, 피터팬, 원더우먼, 아이언맨, 스파이더맨, 헐크, 슈퍼맨, 배트맨, 앤트맨, 스톰, 스쿨버스, 선글라스, 모자, 기타, 컴퓨터, 핸드폰, 랩탑, 태블릿, 고래상어, 백상어, 맨타, 몽구스, 자라, 나무늘보, 테니스공, 악어상어, 가포사이클, 갈가마귀, 갈라파고스거북, 개구리매, 개미와로, 거미좀도롱뇽, 고리뱀, 굴, 꼬마개, 나루토, 닭모병, 대왕판다, 덩쿨, 도나티얼, 도바키, 동굴개구리, 듀건타, 디아블로, 땅거미, 땅도마뱀, 땅뿌리, 라쿤, 무도개, 무덤, 무늬매어, 문어, 미어캣, 바다캄푸치아, 바다해적, 루피, 샹크스, 조로, 샹디, 나미, 우솝, 박하사,
    선인장, 장미, 튤립, 백합, 썸머히야신스, 라벤더, 해바라기, 모란, 제비꽃, 난초, 데이지, 풀, 야자수, 봉선화, 목련, 라일락, 갈대, 민들레, 블루벨, 초롱꽃, 연꽃, 벚나무, 피비, 오이, 당근, 토마토, 감자, 양파, 채소, 브로콜리, 고구마, 시금치, 호박, 오렌지, 사과, 배, 포도, 바나나, 수박, 참외, 딸기, 블루베리, 레몬, 자몽, 키위, 복숭아, 망고, 파인애플, 파파야, 코코넛, 살구, 고무나무, 무화과, 레인보우윌리;
}
